{
  "main": {
    "name": "Encryption in the US is dying.",
    "description": "The introduction of The Lawful Access To Encryped Data Act into law will destroy end-to-end encryption on the internet as we know it. Here's what that is, why you should care, and what you can do about it",
    "image": "profilepic.jpg",
    "bio": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage": "Getting in touch with your state senators and letting them know you object to The Lawful Access To Encrypted Data Act is the best way to make sure your voice is heard.",
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com"
  },
  "resume": {
    "education": [
      {
        "school": "PGP released",
        "degree": "The birth of end-to-end encryption",
        "graduated": "1991",
        "description": "PGP (Pretty Good Privacy) released, providing cryptographic privacy for text, emails, files, and other data throughout the interenet."
      },
      {
        "school": "Phil Zimmermann's criminal investigation",
        "degree": "Are cryptographic programs illegal?",
        "graduated": "1993-1996",
        "description": "Creater of PGP is put under investigation for distributing cryptographic software to countries outside the US."
      },
      {
        "school": "The Publishing of PGP",
        "degree": "End-to-end becomes widespread",
        "graduated": "1995",
        "description": "The PGP source code is published in a book, circumventing the distrobution laws on cryptographic software and providing end-to-end encryption and security for all."
      },
      {
        "school": "WhatsApp incorperates end-to-end encryption",
        "degree": "Largest use of end-to-end encryption to date",
        "graduated": "2016",
        "description": "WhatsApp, a popular messaging service with 1.6 billion users, encorperates end-to-end encryption for all  members."
      },
      {
        "school": "EARN IT Bill introduced",
        "degree": "The beginning of the end",
        "graduated": "2019-2020",
        "description": "The controversial EARN IT Bill is introduced into congress. On the bright side, cybercrime would decrease--but on the downside, every message sent on the internet would be screened from now on. "
      },
      {
        "school": "The Lawful Access to Encrypted Data Act introduced",
        "degree": "The death of end-to-end encryption",
        "graduated": "2020",
        "description": "LAED is introduced into congress as an even stricter bill than EARN IT.  If passed, LAED will require all services using end-to-end encryption to include a 'backdoor', or a way for the government to view the contents of the data being sent."
      }
    ],
    "work": [
      {
        "company": "What is end-to-end encryption?",
        "description": "When you send a piece of data over an end-to-end encrypted line, the program you’re using mathematically generates two cryptographic keys — a public key and a private key. When someone wants to send you a message, the service will encrypt their text or image with your public key, which is available for anyone to see. The trick is that any piece of data that is encoded with your public key cannot be decoded by anyone without your unique private key, which of course, only you will have. Decoding an encrypted message without the use of a private key is deemed cryptographically impossible—even the smartest and fastest computers can’t brute force their way into the message."
      },
      {
        "company": "What's a backdoor?",
        "description": "A 'backdoor' is a piece of programming code that will let a user directly access encrypted data such as personal emails, work documents, important messages, among other things. This governmental backdoor is meant to intercept messages that pertain to crime, but in the wrong hands, could be used to see all interenet traffic of a certain individual."
      },
      {
        "company": "Internet security will decrease.",
        "description": "Man-in-the-middle attacks are a lot easier to perform without end-to-end encryption. These MITM attacks are exactly what they sound like—imagine that you’re sitting in a room with a hallway in the middle of you and a friend. You can’t see around the corner, but you need to relay a secret to your friend that would be super embarrassing if anyone else heard. Unfortunately for you, there’s a “man-in-the-middle” of you two lurking in the hallway, listening into your conversation without you knowing. Now, imagine you’re an employee for a billion-dollar company tasked with transmitting high-profile billing documents, and you can see where this becomes a problem. MITM attacks can be performed on a multitude of unsecure wireless connections such as wi-fi that you’d find anywhere in public. By willingly and knowingly implementing this insecurity, the act severely harms the aspect of online security for the end users of products that incorporate end-to-end encryption."
      },
      {
        "company": "Technological advancements will slow.",
        "description": "Many technological advancements are made by those in the 'free and open source' movement. But with increased accountability and increased time being needed to impliment governmental backdoors in programs, we will most likely see a drop in technological advancements in the next few years."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "60%"
      },
      {
        "name": "VueJs",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "PHP",
        "level": "80%"
      },
      {
        "name": "Swift",
        "level": "50%"
      },
      {
        "name": "JAVA",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  }
}
